/**
 * 彩种Id
 */
export const LOTTERY_ID = {
    /**
     * 胜负彩
     */
    SFC: 1,
    /**
     * 七星彩
     */
    QXC: 3,
    /**
     * 双色球
     */
    SSQ: 5,
    /**
     * 福彩3D
     */
    FC3D: 6,
    /**
     * 七乐彩
     */
    QLC: 13,
    /**
     * 任选9
     */
    RXJ: 19,
    /**
     * 重庆时时彩
     */
    CQSSC: 28,
    /**
     * 吉林时时彩
     */
    JLSSC: 29,
    /**
     * 大乐透
     */
    DLT: 39,
    /**
     * 北京单场
     */
    BJDC: 45,
    /**
     * 山东11选5（老11选5、十一运夺金）
     */
    SD11X5: 62,
    /**
     * 排列3
     */
    PL3: 63,
    /**
     * 排列5
     */
    PL5: 64,
    /**
     * 江苏快3
     */
    JSK3: 65,
    /**
     * 内蒙古快3
     */
    NMGK3: 66,
    /**
     * 江西快3（快3）
     */
    JXK3: 67,
    /**
     * 广西快3（新快3）
     */
    GXK3: 68,
    /**
     * 吉林快3（开心快3）
     */
    JLK3: 69,
    /**
     * 广东11选5（幸运11选5）
     */
    GD11X5: 72,
    /**
     * 新疆11选5（欢乐11选5）
     */
    XJ11X5: 74,
    /**
     * 江西11选5
     */
    JX11X5: 75,
    /**
     * 湖北11选5（好运11选5）
     */
    HB11X5: 78,
    /**
     * 重庆快乐十分
     */
    CQKLSF: 81,
    /**
     * 竞彩足球
     */
    JCZQ: 90,
    /**
     * 竞彩篮球
     */
    JCLQ: 91,
    /**
     * 猜冠军
     */
    CGJ: 95,
    /**
     * 冠亚军
     */
    GYJ: 96,
};

/**
 * 百度渠道列表
 *
 * 中奖弹窗 h5_bd1
 * 我的红包页 h5_bd2
 * 聚合banner h5_bd3
 * @type {Array}
 */
export const BAIDU_FRM_LIST = [
    'bd1',
    'bd2',
    'bd3',
    'zz',
    'zssq',
    'ald'
];
